number1 = float(input("Введите первое число: "))  # запрашиваем у пользователя ввести первое число
number2 = float(input("Введите второе число: "))  # запрашиваем у пользователя ввести второе число
if number1 > number2 : # используем оператор ветвления if с условием, что число 2 меньше числа 1
   print("Наимененьшее значение:", number2) # выводим число 2, потому что оно меньше
elif number1 < number2 : # если первое условие ложное, то число 1 меньше числа 2
   print("Наименьшее значение:", number1) # выводим число 1, тк. оно наименьшее
else: # если первое и второе условие ложное, значит числа равны
   print("Числа равны") # выводим что числа равны
